trunk/app/controllers/news_items_controller.rb

  def index
    @news_items = NewsItem.paginate :page => params[:page], :order => 'created_at DESC', :per_page => 4
---
SELECT * FROM `news_items` ORDER BY created_at DESC LIMIT 0, 4