trunk/app/controllers/products_controller.rb

SELECT * FROM `products` WHERE (product_range_id = 3) ORDER BY highlighted DESC, name ASC
SELECT * FROM `products` WHERE (`products`.`id` = 66)
SELECT * FROM `product_ranges` WHERE (`product_ranges`.`id` = 3)
---
  def index
    # display a single products details and show other products in range as thumbs
    if !params[:product].blank? && !params[:id].blank?
      @product = Product.find(params[:id])
      @products_in_range = []
      if !@product.product_range.blank?