trunk/app/controllers/projects_controller.rb

  def index
    @projects = Project.paginate :page => params[:page], :order => 'created_at DESC', :per_page => 6
---
SELECT * FROM `projects` ORDER BY created_at DESC LIMIT 0, 6
SELECT count(*) AS count_all FROM `projects`