trunk/app/controllers/static_content_controller.rb

SELECT * FROM `tags` WHERE (kind = 'type') ORDER BY name ASC
---
  def home
    @meta_description = t(:meta_home_description)
    @meta_keywords = t(:meta_home_keywords)
    @meta_title = t(:meta_home_title)

    tag = Tag.find_by_name('slideshow')