trunk/app/controllers/admin/tags_controller.rb

SELECT * FROM `tags` WHERE (`tags`.`id` = 5)
---
  def show
    @tag = Tag.find(params[:id])

SELECT * FROM `tags` WHERE (`tags`.`id` = 5)
---
  def edit
    @tag = Tag.find(params[:id])

SELECT * FROM `tags` WHERE (`tags`.`id` = 5)
UPDATE `tags` SET `updated_at` = '2011-01-13 21:50:24', `kind` = 'type_fr', `name` = 'armchairs (fr)' WHERE `id` = 5
---
  def update
    @tag = Tag.find(params[:id])
    params[:tag][:kind].downcase!

    respond_to do |format|
      if @tag.update_attributes(params[:tag])